app/Http/Controllers/ListingController.php

SELECT * FROM `listings` WHERE `tags` like '%marketing%' ORDER BY `created_at` DESC LIMIT 6 offset 0
SELECT count(*) as aggregate FROM `listings` WHERE `tags` like '%marketing%'
---
    public function index(){
        return view('listings.index',[
           'listings' => Listing::latest()->filter(request(['tag', 'search']))->paginate(6)
        ]);

SELECT * FROM `listings` WHERE `listings`.`user_id` = 2 and `listings`.`user_id` IS not NULL
---
    public function manage(){
        return view('listings.manage',['listings' => auth()->user()->listings()->get()]);

SELECT * FROM `listings`
---
    public function getRecord():JsonResponse
    {
        // Fetch products from the database
        $listings = Listing::all();

SELECT * FROM `listings` WHERE `title` like '%wd%' or `description` like '%wd%' or `tags` like '%wd%'
---
    public function search(Request $request){
        // Retrieve the search term from the request
        $search = $request->input('search');

        // Query the database
        $results = Listing::where('title', 'like', '%' . $search . '%')
            ->orWhere('description', 'like', '%' . $search . '%')
            ->orWhere('tags', 'like', '%' . $search . '%')
            ->get();