app/Http/Controllers/UserController.php

    public function store(Request $request){
        $formFields = $request->validate([
            'name' => ['required','min:3'],
            'email' => ['required', 'email', Rule::unique('users', 'email')],
            'password' => 'required|confirmed|min:6'
        ]);

        //Hash password
        $formFields['password'] = bcrypt($formFields['password']);

        //Create user
        $user = User::create($formFields);
---
INSERT INTO `users` (`name`, `email`, `password`, `updated_at`, `created_at`) VALUES ('kola', 'kola@gmail.com', '$2y$12$9VetJpWvmyuBUkVEMIXeUONhiTH.nWvyjpYpQJkJmekL9tNLy8Qau', '2024-11-23 06:01:45', '2024-11-23 06:01:45')